Revit 2027 API
TransactionGroup(Document, String) Constructor
 It constructs a transaction group object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionGroup(
	Document document,
	string transGroupName
)
Public Sub New (
	document As Document,
	transGroupName As String
)
public:
TransactionGroup(
	Document^ document,
	String^ transGroupName
)
new :
        document : Document *
        transGroupName : string -> TransactionGroup
Parameters
document Document
 The document for which this transaction group is being used.
transGroupName String
 Name of the group. The name will be used only for a group that is assimilated at the end.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The group does not start until its Start method is called.
See Also
Reference
TransactionGroup Class
TransactionGroup Overload
Autodesk.Revit.DB Namespace